using Microsoft.AspNetCore.Mvc.Rendering;

namespace SportConnect.Services
{
    public class CountryService
    {
        private static readonly List<string> countries = new List<string>
        {
            "Южна Джорджия", "Гренада", "Швейцария", "Сиера Леоне", "Унгария", "Тайван", "Уолис и Футуна",
            "Барбадос", "Острови Питкерн", "Бряг на слоновата кост", "Тунис", "Италия", "Бенин", "Индонезия", "Кабо Верде",
            "Сейнт Китс и Невис", "Лаос", "Карибска Нидерландия", "Уганда", "Андора", "Бурунди", "Южна Африка",
            "Франция", "Либия", "Мексико", "Габон", "Северни Мариански острови", "Северна Македония", "Китай", "Йемен",
            "Сен Бартелеми", "Гърнси", "Соломонови острови", "Свалбард и Ян Майен", "Фарьорски острови", "Узбекистан",
            "Египет", "Сенегал", "Шри Ланка", "Палестина", "Бангладеш", "Перу", "Сингапур", "Турция", "Афганистан",
            "Аруба", "Острови Кук", "Обединено кралство", "Замбия", "Финландия", "Нигер", "Коледен остров", "Токелау",
            "Гвинея-Бисау", "Азербайджан", "Реюнион", "Джибути", "Северна Корея", "Мавриций", "Монсерат",
            "Американски Вирджински острови", "Колумбия", "Гърция", "Хърватия", "Мароко", "Алжир", "Антарктика",
            "Нидерландия", "Судан", "Фиджи", "Лихтенщайн", "Непал", "Пуерто Рико", "Грузия", "Пакистан", "Монако",
            "Ботсвана", "Ливан", "Папуа Нова Гвинея", "Майот", "Доминиканска република", "Остров Норфолк", "Остров Буве",
            "Катар", "Мадагаскар", "Индия", "Сирия", "Черна гора", "Есватини", "Парагвай", "Ел Салвадор", "Украйна",
            "Остров Ман", "Намибия", "Обединени арабски емирства", "България", "Гренландия", "Германия", "Камбоджа", "Ирак",
            "Френски южни и антарктически територии", "Швеция", "Куба", "Киргизстан", "Русия", "Малайзия", "Сао Томе и Принсипи",
            "Кипър", "Канада", "Малави", "Саудитска Арабия", "Босна и Херцеговина", "Етиопия", "Испания", "Словения", "Оман",
            "Сен Пиер и Микелон", "Макао", "Сан Марино", "Лесото", "Маршалови острови", "Синт Мартен", "Исландия",
            "Люксембург", "Аржентина", "Търкс и Кайкос", "Науру", "Кокосови (Кийлинг) острови", "Западна Сахара",
            "Доминика", "Коста Рика", "Австралия", "Тайланд", "Хаити", "Тувалу", "Хондурас", "Екваториална Гвинея", "Сейнт Лусия",
            "Френска Полинезия", "Беларус", "Латвия", "Палау", "Гваделупа", "Филипини", "Гибралтар", "Дания", "Камерун",
            "Гвинея", "Бахрейн", "Суринам", "ДР Конго", "Сомалия", "Чехия", "Нова Каледония", "Вануату",
            "Света Елена, Възнесение и Тристан да Куня", "Того", "Британски Вирджински острови", "Кения", "Ниуе",
            "Острови Хърд и Макдоналд", "Руанда", "Естония", "Румъния", "Тринидад и Тобаго", "Гаяна", "Източен Тимор",
            "Виетнам", "Уругвай", "Ватикан", "Хонконг", "Австрия", "Антигуа и Барбуда", "Туркменистан", "Мозамбик",
            "Панама", "Микронезия", "Ирландия", "Кюрасао", "Френска Гвиана", "Норвегия", "Оландски острови", "Централноафриканска република",
            "Буркина Фасо", "Еритрея", "Танзания", "Южна Корея", "Йордания", "Мавритания", "Литва", "Малки далечни острови на САЩ",
            "Словакия", "Ангола", "Казахстан", "Молдова", "Мали", "Фолкландски острови", "Армения", "Самоа", "Джърси", "Япония",
            "Боливия", "Чили", "САЩ", "Сейнт Винсент и Гренадини", "Бермудски острови", "Сейшели",
            "Британска територия в Индийския океан", "Гватемала", "Еквадор", "Мартиника", "Таджикистан", "Малта", "Гамбия",
            "Нигерия", "Бахамски острови", "Косово", "Кувейт", "Малдиви", "Южен Судан", "Иран", "Албания", "Бразилия", "Сърбия",
            "Белиз", "Мианмар", "Бутан", "Венецуела", "Либерия", "Ямайка", "Полша", "Кайманови острови", "Бруней", "Коморски острови",
            "Гуам", "Тонга", "Кирибати", "Гана", "Чад", "Зимбабве", "Сен Мартен", "Монголия", "Португалия",
            "Американска Самоа", "Република Конго", "Белгия", "Израел", "Нова Зеландия", "Никарагуа", "Ангила"
        };

        public virtual List<SelectListItem> GetAllCountries()
        {
            return countries.OrderBy(x => x).Select(x => new SelectListItem { Value = x, Text = x }).ToList();
        }
    }
}